In [1]:
import pandas as pd
import numpy as np
from datetime import datetime

In [2]:
year=1994
month=3
day=5
hour=11
minu=30
sec=30

In [3]:
date=datetime(year=year,month=month,day=day)
date

datetime.datetime(1994, 3, 5, 0, 0)

In [4]:
date1=datetime(year=year,month=month,day=day,hour=hour,minute=minu,second=sec)
date1

datetime.datetime(1994, 3, 5, 11, 30, 30)

In [5]:
date1.hour

11

In [6]:
my_series=pd.Series(["Mar 5, 1994","2000-01-31",None])

In [7]:
my_series

0    Mar 5, 1994
1     2000-01-31
2           None
dtype: object

In [8]:
#to_datetime is for series as well as dataframe
my_series=pd.to_datetime(my_series)
my_series

0   1994-03-05
1   2000-01-31
2          NaT
dtype: datetime64[ns]

In [9]:
my_series[0].year

1994

In [10]:
new_date="2000-01-30"
day=pd.to_datetime(new_date)
print(day.year,day.month,day.day)

2000 1 30

In [29]:
new_date="2000-30-06"
day=pd.to_datetime(new_date)
print(day.year,day.month,day.day)

ParserError: month must be in 1..12: 2000-30-06

In [12]:
#to resolve this we can use "dayfirst"
new_date="2000-30-06"
day=pd.to_datetime(new_date,dayfirst=True)
print(day.year,day.month,day.day)

2000 6 30

In [13]:
#if value is greater then 12 then pandas is smart enought to recongnize it as date in this pattern
new_date="16-01-1994"
day=pd.to_datetime(new_date)
print(f"year = {day.year},month= {day.month},day= {day.day}")

year = 1994,month= 1,day= 16

In [14]:
new_date="01-17-1994"
day=pd.to_datetime(new_date)
print(f"year = {day.year},month= {day.month},day= {day.day}")

year = 1994,month= 1,day= 17

In [15]:
new_date="12--Mar--1994"
new_date=pd.to_datetime(new_date,format="%d--%b--%Y")
new_date

Timestamp('1994-03-12 00:00:00')

In [16]:
#pandas is smart enough to convert this in datetime
custom_date=pd.to_datetime("5th of March 1994")
custom_date

Timestamp('1994-03-05 00:00:00')

In [17]:
df=pd.read_csv("../data/03-Pandas/RetailSales_BeerWineLiquor.csv")
df

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [18]:
df.dtypes

DATE             object
MRTSSM4453USN     int64
dtype: object

In [19]:
df["DATE"]=pd.to_datetime(df["DATE"])

In [20]:
df.dtypes

DATE             datetime64[ns]
MRTSSM4453USN             int64
dtype: object

In [21]:
df["DATE"][0]

Timestamp('1992-01-01 00:00:00')

In [22]:
df

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [23]:
#we can also declare a column as date while reading
df2=pd.read_csv("../data/03-Pandas/RetailSales_BeerWineLiquor.csv",parse_dates=["DATE"])
df2

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [24]:
df2.dtypes

DATE             datetime64[ns]
MRTSSM4453USN             int64
dtype: object

In [25]:
df2=df2.set_index("DATE")
df2

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [26]:
#there is different method for grouping the dates with some separate rules
#this will only work when you have datetime type of index
df3=df2.resample(rule="A").mean()
df3

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [27]:
#for Datetime "dt" is similiar to str
df2=df2.reset_index()
df4=df2.groupby(df2["DATE"].dt.year).mean()
df4

      MRTSSM4453USN
DATE
1992    1807.250000
1993    1794.833333
1994    1841.750000
1995    1833.916667
1996    1929.750000
1997    2006.750000
1998    2115.166667
1999    2206.333333
2000    2375.583333
2001    2468.416667
2002    2491.166667
2003    2539.083333
2004    2682.416667
2005    2797.250000
2006    3001.333333
2007    3177.333333
2008    3292.000000
2009    3353.750000
2010    3450.083333
2011    3532.666667
2012    3697.083333
2013    3839.666667
2014    4023.833333
2015    4212.500000
2016    4434.416667
2017    4602.666667
2018    4830.666667
2019    4972.750000
2020    4922.500000

In [28]:
df2[df2["DATE"].dt.year>1999]

          DATE  MRTSSM4453USN
96  2000-01-01           1920
97  2000-02-01           1976
98  2000-03-01           2190
99  2000-04-01           2132
100 2000-05-01           2357
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[244 rows x 2 columns]